recipes/vegetarian-burrito-bowl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vegetarian Burrito Bowl</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Vegetarian Burrito Bowl</h1>
<p>
<a href="http://thefoodiephysician.com/2015/03/dining-with-doc-protein-packed.html">Original link</a>
</p>

<div id="outline-container-orgcfb4dea" class="outline-2">
<h2 id="orgcfb4dea">Ingredients</h2>
<div class="outline-text-2" id="text-orgcfb4dea">
<ul class="org-ul">
<li>4 Chile Relleno Boca Essentials patties</li>
<li>3 cups cooked brown rice</li>
<li>1 cup grape tomatoes, quartered</li>
<li>1 1/2 cups shredded Romaine lettuce</li>
<li>1/2 ripe Haas avocado, diced (optional)</li>
</ul>
</div>

<div id="outline-container-org5e011bb" class="outline-3">
<h3 id="org5e011bb">Corn salsa:</h3>
<div class="outline-text-3" id="text-org5e011bb">
<ul class="org-ul">
<li>1 cup cooked corn</li>
<li>2 tablespoons finely chopped red onion</li>
<li>1 tablespoon chopped cilantro</li>
<li>1 teaspoon lime juice</li>
<li>Salt</li>
</ul>
</div>
</div>

<div id="outline-container-org563b4d7" class="outline-3">
<h3 id="org563b4d7">Avocado Cilantro Sauce:</h3>
<div class="outline-text-3" id="text-org563b4d7">
<ul class="org-ul">
<li>1/2 ripe Haas avocado</li>
<li>2 tablespoons nonfat plain Greek yogurt</li>
<li>2 tablespoons cilantro</li>
<li>1 1/2 teaspoons lime juice</li>
<li>1/2 teaspoon honey</li>
<li>2 tablespoons water</li>
<li>Kosher salt</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0b98310" class="outline-2">
<h2 id="org0b98310">Method</h2>
<div class="outline-text-2" id="text-org0b98310">
<ol class="org-ol">
<li>Cook the Chile Relleno Boca Essentials patties according to package directions. Chop them into bite-sized pieces.</li>
<li>Mix all of the corn salsa ingredients together in a bowl.</li>
<li>To make the avocado cilantro sauce, puree all of the ingredients in a mini food processor or blender. Adjust seasoning to taste.</li>
<li>Divide the rice among 4 bowls. Top with equal portions of Boca patties, corn salsa, tomato, lettuce and avocado. Drizzle the avocado cilantro sauce on top. Enjoy!</li>
</ol>
</div>
</div>
</div>
</body>
</html>
